# Dataset Titanic

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data=pd.read_csv("titanic.csv")

In [10]:
from pandas_profiling import ProfileReport

prof=ProfileReport(data)
prof.to_file(output_file='Titanic_EDA.html')

Summarize dataset:   0%|          | 0/5 [00:00<?, ?it/s]

Generate report structure:   0%|          | 0/1 [00:00<?, ?it/s]

Render HTML:   0%|          | 0/1 [00:00<?, ?it/s]

Export report to file:   0%|          | 0/1 [00:00<?, ?it/s]

# Analysis

In [3]:
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [5]:
data.isnull().mean()*100

survived        0.000000
pclass          0.000000
sex             0.000000
age            19.865320
sibsp           0.000000
parch           0.000000
fare            0.000000
embarked        0.224467
class           0.000000
who             0.000000
adult_male      0.000000
deck           77.216611
embark_town     0.224467
alive           0.000000
alone           0.000000
dtype: float64

In [6]:
data.shape

(891, 15)

1. There are 15 columns and 891 rows
2. There are 4 columns which has missing values.(age,embarked,deck,embark_town)
3. there are 8 Categorical,4 numerical and 3 boolean variable.
4. deck 77% data is missing. so we can remove that column

In [7]:
df=data.drop(['deck'],axis=1)

In [8]:
df.isnull().mean()

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [13]:
def mean_age(cols):
    age=cols[0]
    pclass=cols[1]
    if pd.isnull(age):
        if pclass==1:
            return 37
        elif pclass==2:
            return 29
        else:
            return 24
    else:
        return age

In [16]:
df['age']=df[['age','pclass']].apply(mean_age,axis=1)

In [19]:
df['age'].isnull().sum()

0

In [20]:
df.isnull().mean()*100

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.000000
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.224467
class          0.000000
who            0.000000
adult_male     0.000000
embark_town    0.224467
alive          0.000000
alone          0.000000
dtype: float64

In [21]:
df.drop(columns=['embarked','alive','alone'],inplace=True)

In [22]:
df.isnull().mean()*100

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.000000
sibsp          0.000000
parch          0.000000
fare           0.000000
class          0.000000
who            0.000000
adult_male     0.000000
embark_town    0.224467
dtype: float64

In [23]:
df

,survived,pclass,sex,age,sibsp,parch,fare,class,who,adult_male,embark_town
0,0,3,male,24,1,0,7.2500,Third,man,True,Southampton
1,1,1,female,37,1,0,71.2833,First,woman,False,Cherbourg
2,1,3,female,24,0,0,7.9250,Third,woman,False,Southampton
3,1,1,female,37,1,0,53.1000,First,woman,False,Southampton
4,0,3,male,24,0,0,8.0500,Third,man,True,Southampton
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,29,0,0,13.0000,Second,man,True,Southampton
887,1,1,female,37,0,0,30.0000,First,woman,False,Southampton
888,0,3,female,24,1,2,23.4500,Third,woman,False,Southampton
889,1,1,male,37,0,0,30.0000,First,man,True,Cherbourg
890,0,3,male,24,0,0,7.7500,Third,man,True,Queenstown

In [38]:
df.dropna(inplace=True)

In [39]:
df.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
class          0
who            0
adult_male     0
embark_town    0
dtype: int64

In [55]:
from sklearn.preprocessing import StandardScaler

In [56]:
scaler = StandardScaler()

# Dealing with categorical data

In [46]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import OrdinalEncoder

In [70]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,class,who,adult_male,embark_town
0,0,3,male,24,1,0,7.2500,Third,man,True,Southampton
1,1,1,female,37,1,0,71.2833,First,woman,False,Cherbourg
2,1,3,female,24,0,0,7.9250,Third,woman,False,Southampton
3,1,1,female,37,1,0,53.1000,First,woman,False,Southampton
4,0,3,male,24,0,0,8.0500,Third,man,True,Southampton

In [89]:
y=df.iloc[:,:1]
X=df.iloc[:,1:]
X

,pclass,sex,age,sibsp,parch,fare,class,who,adult_male,embark_town
0,3,male,24,1,0,7.2500,Third,man,True,Southampton
1,1,female,37,1,0,71.2833,First,woman,False,Cherbourg
2,3,female,24,0,0,7.9250,Third,woman,False,Southampton
3,1,female,37,1,0,53.1000,First,woman,False,Southampton
4,3,male,24,0,0,8.0500,Third,man,True,Southampton
...,...,...,...,...,...,...,...,...,...,...
886,2,male,29,0,0,13.0000,Second,man,True,Southampton
887,1,female,37,0,0,30.0000,First,woman,False,Southampton
888,3,female,24,1,2,23.4500,Third,woman,False,Southampton
889,1,male,37,0,0,30.0000,First,man,True,Cherbourg
890,3,male,24,0,0,7.7500,Third,man,True,Queenstown

In [90]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size=0.20, 
                                                    random_state=2)

In [92]:
X_test

,pclass,sex,age,sibsp,parch,fare,class,who,adult_male,embark_town
560,3,male,24,0,0,7.7500,Third,man,True,Queenstown
37,3,male,24,0,0,8.0500,Third,man,True,Southampton
615,2,female,29,1,2,65.0000,Second,woman,False,Southampton
170,1,male,37,0,0,33.5000,First,man,True,Southampton
69,3,male,24,2,0,8.6625,Third,man,True,Southampton
...,...,...,...,...,...,...,...,...,...,...
377,1,male,37,0,2,211.5000,First,man,True,Cherbourg
90,3,male,24,0,0,8.0500,Third,man,True,Southampton
81,3,male,24,0,0,9.5000,Third,man,True,Southampton
592,3,male,24,0,0,7.2500,Third,man,True,Southampton
870,3,male,24,0,0,7.8958,Third,man,True,Southampton

In [93]:
 transformer=ColumnTransformer(transformers=[
     ('tnf1',OrdinalEncoder(categories=[['Third','Second','First']]),['class']),
     ('tnf2',OneHotEncoder(sparse=False,drop='first'),['sex','who','embark_town','adult_male'])
 ],remainder='passthrough')

In [99]:
X_train=transformer.fit_transform(X_train)
X_test=transformer.transform(X_test)

In [101]:
X_train=scaler.fit_transform(X_train)

X_test=scaler.transform(X_test)

# Applying logistic regression

In [102]:
from sklearn.linear_model import LogisticRegression

In [103]:
logmodel = LogisticRegression()
logmodel.fit(X_train,y_train)

d:\Users\durge\anaconda3\lib\site-packages\sklearn\utils\validation.py:993: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

LogisticRegression()

In [106]:
y_pred= logmodel.predict(X_test)

# Evaluation

In [104]:
from sklearn.metrics import classification_report

In [107]:
print(classification_report(y_test,y_pred))

              precision    recall  f1-score   support

           0       0.84      0.86      0.85       111
           1       0.75      0.73      0.74        67

    accuracy                           0.81       178
   macro avg       0.80      0.79      0.80       178
weighted avg       0.81      0.81      0.81       178